Contact/UpdateContact.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <ns7:ClientInfoHeader soapenv:mustUnderstand="0" xmlns:ns7="urn:messages.ws.rightnow.com/v1_3">
         <ns7:AppID>Basic Update</ns7:AppID>
      </ns7:ClientInfoHeader>
      <wsse:Security mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username>nope</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">nope</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns7:Update xmlns:ns7="urn:messages.ws.rightnow.com/v1_3">
         <ns7:RNObjects xsi:type="ns4:Contact" xmlns:ns4="urn:objects.ws.rightnow.com/v1_3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <ID id="40859" xmlns="urn:base.ws.rightnow.com/v1_3"/>
            <ns4:CustomFields xsi:type="ns2:GenericObject" xmlns:ns2="urn:generic.ws.rightnow.com/v1_3">
               <ns2:ObjectType>
                  <ns2:TypeName>ContactCustomFields</ns2:TypeName>
               </ns2:ObjectType>
               <ns2:GenericFields dataType="OBJECT" name="CO">
                  <ns2:DataValue>
                     <ns2:ObjectValue xsi:type="ns2:GenericObject">
                        <ns2:ObjectType>
                           <ns2:TypeName>ContactCustomFieldsCO</ns2:TypeName>
                        </ns2:ObjectType>
                        <ns2:GenericFields dataType="DATE" name="Date_Of_Birth">
                           <ns2:DataValue>
                              <ns2:DateValue>2015-10-09</ns2:DateValue>
                           </ns2:DataValue>
                        </ns2:GenericFields>
                     </ns2:ObjectValue>
                  </ns2:DataValue>
               </ns2:GenericFields>
               <ns2:GenericFields dataType="OBJECT" name="c">
                  <ns2:DataValue>
                     <ns2:ObjectValue xsi:type="ns2:GenericObject">
                        <ns2:ObjectType>
                           <ns2:TypeName>ContactCustomFieldsc</ns2:TypeName>
                        </ns2:ObjectType>
                        <ns2:GenericFields dataType="STRING" name="cospec_id">
                           <ns2:DataValue>
                              <ns2:StringValue>382822</ns2:StringValue>
                           </ns2:DataValue>
                        </ns2:GenericFields>
                        <ns2:GenericFields dataType="DATE" name="communication_consent_expiry">
                           <ns2:DataValue>
                              <ns2:DateValue>2015-12-31</ns2:DateValue>
                           </ns2:DataValue>
                        </ns2:GenericFields>
                        <ns2:GenericFields dataType="NAMED_ID_LIST" name="salutation">
                           <ns2:DataValue>
                              <ns2:NamedIDValue>
                                 <ID id="2" xmlns="urn:base.ws.rightnow.com/v1_3"/>
                              </ns2:NamedIDValue>
                           </ns2:DataValue>
                        </ns2:GenericFields>
                     </ns2:ObjectValue>
                  </ns2:DataValue>
               </ns2:GenericFields>
            </ns4:CustomFields>
            <ns4:Emails>
               <ns4:EmailList action="update">
                  <ns4:Address>seshi@exadsfmple.com</ns4:Address>
                  <ns4:AddressType>
                     <ID id="1" xmlns="urn:base.ws.rightnow.com/v1_3"/>
                  </ns4:AddressType>
               </ns4:EmailList>
            </ns4:Emails>
            <ns4:Name>
               <ns4:First>Seshi</ns4:First>
               <ns4:Last>Smithelt</ns4:Last>
            </ns4:Name>
            <ns4:Phones>
               <ns4:PhoneList action="update">
                  <ns4:Number>33345671189</ns4:Number>
                  <ns4:PhoneType>
                     <ID id="1" xmlns="urn:base.ws.rightnow.com/v1_3"/>
                  </ns4:PhoneType>
               </ns4:PhoneList>
            </ns4:Phones>
         </ns7:RNObjects>
         <ns7:ProcessingOptions>
            <ns7:SuppressExternalEvents>false</ns7:SuppressExternalEvents>
            <ns7:SuppressRules>false</ns7:SuppressRules>
         </ns7:ProcessingOptions>
      </ns7:Update>
   </soapenv:Body>
</soapenv:Envelope>